Revit 2027 API
SplitButton.CurrentButton Property
Gets or sets the current PushButton of the SplitButton.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PushButton CurrentButton { get; set; }
Public Property CurrentButton As PushButton
	Get
	Set
public:
property PushButton^ CurrentButton {
	PushButton^ get ();
	void set (PushButton^ value);
}
member CurrentButton : PushButton with get, set
Property Value
PushButton
Exceptions
Exception | Condition
ArgumentNullException | Thrown when trying to set the CurrentButton to null.
ArgumentException | Thrown when trying to set the CurrentButton to a button which is not in current drop-down list.
InvalidOperationException | Thrown when trying to set the CurrentButton if IsSynchronizedWithCurrentItem is false.
Remarks
This property is applicable only if IsSynchronizedWithCurrentItem is true. The default value of this property will be the first enabled PushButton in the drop down list after the SplitButton is shown.
See Also
Reference
SplitButton Class
Autodesk.Revit.UI Namespace